tap "getargv/tap", "git@github.com:getargv/homebrew-tap.git"
tap "homebrew/bundle"
tap "phusion/passenger"
tap "oven-sh/bun"

# untap "homebrew/core"
# untap "homebrew/services"

brew "bash"
brew "bash-completion@2"
brew "bash-git-prompt"
brew "bash-language-server"
brew "bat"
brew "bear"
brew "bundler-completion"
brew "colima"
brew "criterion"
brew "difftastic"
brew "dnsmasq"
brew "docker"
brew "docker-buildx"
brew "docker-completion"
brew "docker-compose"
brew "docker-credential-helper"
brew "dotnet"
brew "doxygen"
brew "dust"
brew "emacs"
brew "eza"
brew "fakeapxs", args: ["HEAD"]
brew "fd"
brew "ffmpeg"
brew "geckodriver"
brew "getargv/tap/getargv"
brew "getargv/tap/libgetargv"
brew "gh" # required by brew itself
brew "git-delta"
brew "gnupg"
brew "go"
brew "gopls"
brew "google-authenticator-libpam"
brew "htmlq"
brew "hyfetch"
brew "hyperfine"
brew "jless"
brew "llvm"
brew "mailpit"
brew "mas"
brew "maven"
brew "nginx"
brew "nmap"
brew "node"
brew "node@20"
brew "openjdk"
brew "openssl@3"
brew "oven-sh/bun/bun"
brew "pam-duress", args: ["HEAD"]
brew "passenger", link: false
brew "phusion/passenger/passenger-enterprise"
brew "pigz"
brew "pinentry-mac"
brew "pkg-config"
brew "pngcrush"
brew "postgresql@17", link: true
brew "pyright"
brew "python@3.13"
brew "rbenv"
brew "rbenv-default-gems"
brew "ripgrep"
brew "ruby-build"
brew "rust-analyzer"
brew "rustup"
brew "shellcheck"
brew "swift-format"
brew "tiny_php"
brew "transmission-cli"
brew "tree"
brew "wasm-pack"
brew "wget"
brew "xz"
brew "yaml-language-server"

mas "1Blocker", id: 1365531024
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 1529448980
# mas "Xcode", id: 497799835
# mas "Apple Configurator 2", id: 1037126344

cask_args appdir: '/Applications', require_sha: true, language: 'en-CA'

# cask 'sketch' # cannot use latest version with my license... https://download.sketch.com/sketch-75-129697.zip
cask "1password-cli"
# 1password 8 is electron crap
cask "1password@7"
cask "blender"
# cask 'dolphin'
cask "firefox@developer-edition", args: { require_sha: false }
cask "tower"
cask "vmware-fusion"
