tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "phusion/passenger"
tap "getargv/tap"

# untap "homebrew/core"
# untap "homebrew/cask"
# untap "homebrew/services"

brew "bash"
brew "bash-completion@2"
brew "bash-git-prompt"
brew "bash-language-server"
brew "bat"
brew "bear"
brew "colima"
brew "criterion"
brew "difftastic"
brew "dnsmasq"
brew "docker"
brew "docker-buildx"
brew "docker-credential-helper"
brew "dotnet"
brew "doxygen"
brew "dust"
brew "emacs"
brew "eza"
brew "fd"
brew "geckodriver"
brew "getargv/tap/getargv"
brew "getargv/tap/libgetargv"
brew "git-delta"
brew "gnupg"
brew "go"
brew "google-authenticator-libpam"
brew "htmlq"
brew "hyperfine"
brew "jq"
brew "llvm"
brew "mailhog"
brew "mas"
brew "maven"
brew "neofetch"
brew "nginx"
brew "node"
brew "node@18"
brew "openssl@3"
brew "pam-duress"
brew "passenger", link: false
brew "phusion/passenger/passenger-enterprise"
brew "pigz"
brew "pinentry-mac"
brew "pngcrush"
brew "postgresql@16"
brew "pyright"
brew "rbenv"
brew "rbenv-default-gems"
brew "ripgrep"
brew "rust-analyzer"
brew "rustup-init"
brew "shellcheck"
brew "tiny_php"
brew "transmission-cli"
brew "tree"
brew "wget"
brew "xz"

mas "1Blocker", id: 1365531024
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 1529448980
# mas "Xcode", id: 497799835
# mas "Apple Configurator 2", id: 1037126344

cask_args appdir: '/Applications', require_sha: true, language: 'en-CA'

# cask 'sketch' # cannot use latest version with my license... https://download.sketch.com/sketch-75-129697.zip
cask "1password-cli"
cask 'tower'
cask 'homebrew/cask-versions/firefox-developer-edition', args: {require_sha: false}
cask 'homebrew/cask-versions/1password7'
cask 'vmware-fusion'
# cask 'dolphin'
# cask 'wireshark'
# cask 'sublime-merge'
